### pandas-modules, basic examples, Series-data

In [1]:
# typical imports 
# pip install numpy
# pip install pandas
import numpy as np
import pandas as pd

Series is similar to NumPy -vector (a basic number list). We rarely use series-data, but it's good to know what they are if for some reason your data happens to be in Series -format.

In [2]:
# some labels and test values
labels = ["Finland", "Sweden", "Norway", "Denmark"]
values = [1599, 1729, 2899, 1999]

# combine everything into a series
ser1 = pd.Series(values, labels)

In [3]:
ser1.to_frame()

            0
Finland  1599
Sweden   1729
Norway   2899
Denmark  1999

In [4]:
# you can also get only one piece of data
# from the series
int(ser1['Finland'])

1599

In [5]:
# dictionaries also possible
words = {"Milk": 1.5, "Water": 0.1, "Coffee": 10.5}
ser1 = pd.Series(words)
ser1.to_frame()

           0
Milk     1.5
Water    0.1
Coffee  10.5